{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "arts_&_culture",
    "1": "business_&_entrepreneurs",
    "2": "celebrity_&_pop_culture",
    "3": "diaries_&_daily_life",
    "4": "family",
    "5": "fashion_&_style",
    "6": "film_tv_&_video",
    "7": "fitness_&_health",
    "8": "food_&_dining",
    "9": "gaming",
    "10": "learning_&_educational",
    "11": "music",
    "12": "news_&_social_concern",
    "13": "other_hobbies",
    "14": "relationships",
    "15": "science_&_technology",
    "16": "sports",
    "17": "travel_&_adventure",
    "18": "youth_&_student_life"
  },
  "initializer_range": 0.02,
  "label2id": {
    "arts_&_culture": 0,
    "business_&_entrepreneurs": 1,
    "celebrity_&_pop_culture": 2,
    "diaries_&_daily_life": 3,
    "family": 4,
    "fashion_&_style": 5,
    "film_tv_&_video": 6,
    "fitness_&_health": 7,
    "food_&_dining": 8,
    "gaming": 9,
    "learning_&_educational": 10,
    "music": 11,
    "news_&_social_concern": 12,
    "other_hobbies": 13,
    "relationships": 14,
    "science_&_technology": 15,
    "sports": 16,
    "travel_&_adventure": 17,
    "youth_&_student_life": 18
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "multi_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.36.2",
  "vocab_size": 30522
}
